Documents/ПутевойЛист_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПутевойЛист_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыАптека</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыВодитель</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьКонтрагентов</Name>
					<Comment>Если ИСТИНА то при сохранении будет объединять контрагентов в один документ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеСФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФНомерСчетфактуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратнаяСчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПутевойЛист_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПечатьШКСчетФактур(Команда)
	//масСтрок=Элементы.Данные.ВыделенныеСтроки;
	масДок=Новый Массив;
	Для Каждого эл_ТЧДанные Из Объект.Данные Цикл
		//докБЯС=Элементы.Данные.ДанныеСтроки(эл_масСтрок).ДокументПрихода;
		докБЯС=эл_ТЧДанные.ДокументПрихода;

		Сообщить(докБЯС);
		масДок.Добавить(докБЯС);		
		
	КонецЦикла;
	//ТД=Новый ТабличныйДокумент;
	ТД=ПечатьВыделенныхБЯССЕРВЕР(масДок);
	  	
	ТД.Показать();

КонецПроцедуры


 &НаСервере
 Функция ПечатьВыделенныхБЯССЕРВЕР(масДок) 
	 
	 ТД=Новый ТабличныйДокумент;
	  ТД_БЯС=Новый ТабличныйДокумент;

    Для Каждого эл_масДок Из масДок Цикл
		//Сообщить(докБЯС);
        Документы.БольшаяЯчеистаяСборка.Печать(ТД_БЯС,эл_масДок);
		ТД.Вывести(ТД_БЯС);
	КонецЦикла;

	 	
	Возврат ТД;
	 
 КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Водитель",Объект.Водитель);
 	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Дата1",НачалоДня(Объект.Дата));
	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Дата2",КонецДня(Объект.Дата));
КонецПроцедуры

&НаКлиенте
 Процедура ВозвратныеСФВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 ОткрытьЗначение(Элементы.ВозвратныеСФ.ТекущиеДанные.Ссылка);
 КонецПроцедуры
